Repository: xcv58/MacTools
Catalog: Sources/Resources/Localization/Settings.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# actionInput.alias.section
source: 命令面板触发短语
ar: عبارة تشغيل لوحة الأوامر
de: Auslösephrase für die Befehlspalette
en: Command Palette Trigger Phrase
es: Frase de activación de la paleta de comandos
fr: Phrase de déclenchement de la palette de commandes
ja: コマンドパレットのトリガーフレーズ
ko: 명령 팔레트 트리거 문구
pt: Frase de gatilho da paleta de comandos
ru: Триггерная фраза палитры команд
tr: Komut Paleti Tetikleyici İfadesi
zh_hant: 命令面板觸發短語

# actionInput.alias.title
source: 触发短语
ar: عبارة التشغيل
de: Auslösephrase
en: Trigger phrase
es: Frase de activación
fr: Phrase de déclenchement
ja: トリガーフレーズ
ko: 트리거 문구
pt: Frase de gatilho
ru: Триггерная фраза
tr: Tetikleyici ifade
zh_hant: 觸發短語

# actionInput.alias.save
source: 保存
ar: حفظ
de: Sichern
en: Save
es: Guardar
fr: Enregistrer
ko: 저장
pt: Salvar
ru: Сохранить
tr: Kaydet
zh_hant: 儲存

# actionInput.alias.reset
source: 恢复默认
ar: استعادة الافتراضي
de: Auf Standard zurücksetzen
en: Restore Default
es: Restaurar valor predeterminado
fr: Restaurer les valeurs par défaut
ja: デフォルトに戻す
ko: 기본값 복원
pt: Restaurar padrão
ru: Восстановить настройки по умолчанию
tr: Varsayılana Dön
zh_hant: 還原預設

# actionInput.alias.preview
source: 示例：%@ 你的消息 ↵
ar: مثال: %@ رسالتك ↵
de: Beispiel: %@ Ihre Nachricht ↵
en: Example: %@ your message ↵
es: Ejemplo: %@ tu mensaje ↵
fr: Exemple : %@ votre message ↵
ja: 例: %@ あなたのメッセージ ↵
ko: 예: %@ 메시지 ↵
pt: Exemplo: %@ sua mensagem ↵
ru: Пример: %@ ваше сообщение ↵
tr: Örnek: %@ iletiniz ↵
zh_hant: 例如：%@ 你的訊息 ↵

# actionInput.alias.invalid
source: 请输入不含首尾空格或换行的短语，最多 64 个字符。
ar: أدخل عبارة بدون مسافات بادئة/لاحقة أو فواصل أسطر، حتى 64 حرفًا.
de: Geben Sie eine Phrase mit bis zu 64 Zeichen ein (ohne führende/nachgestellte Leerzeichen oder Zeilenumbrüche).
en: Enter a phrase without leading/trailing spaces or line breaks, up to 64 characters.
es: Ingrese una frase sin espacios iniciales/finales ni saltos de línea, hasta 64 caracteres.
fr: Saisissez une phrase sans espaces de début/fin ni sauts de ligne, jusqu'à 64 caractères.
ja: 前後にスペースがなく、改行を含まない 64 文字以内のフレーズを入力してください。
ko: 앞뒤 공백이나 줄바꿈 없이 최대 64자까지 문구를 입력하세요.
pt: Insira uma frase sem espaços iniciais/finais ou quebras de linha, com até 64 caracteres.
ru: Введите фразу длиной до 64 символов без начальных/конечных пробелов и разрывов строк.
tr: En fazla 64 karakterden oluşan, başında ve sonunda boşluk ya da satır sonu bulunmayan bir ifade girin.
zh_hant: 請輸入開頭及結尾不含空格、且不含換行的短語，最多 64 個字元。

# actionInput.alias.unavailable
source: 操作已更改，请重新打开设置。
ar: تم تغيير هذا الإجراء. أعد فتح الإعدادات.
de: Diese Aktion wurde geändert. Öffnen Sie die Einstellungen erneut.
en: This action changed. Reopen settings.
es: Esta acción cambió. Vuelva a abrir la configuración.
fr: Cette action a changé. Rouvrez les paramètres.
ja: このアクションが変更されました。設定を再度開いてください。
ko: 이 동작이 변경되었습니다. 설정을 다시 여세요.
pt: Esta ação foi alterada. Reabra as configurações.
ru: Это действие изменено. Снова откройте настройки.
tr: Bu eylem değişti. Ayarları yeniden açın.
zh_hant: 操作已更改，請重新開啟設定。

# actionInput.alias.conflict
source: 与“%@”的触发短语冲突。
ar: يتعارض مع عبارة التشغيل لـ "%@".
de: Konflikt mit der Auslösephrase für „%@“.
en: Conflicts with the trigger phrase for “%@”.
es: Entra en conflicto con la frase de activación de «%@».
fr: Conflit avec la phrase de déclenchement de « %@ ».
ja: 「%@」のトリガーフレーズと競合します。
ko: "%@"의 트리거 문구와 충돌합니다.
pt: Conflita com a frase de acionamento de “%@”.
ru: Конфликтует с триггерной фразой для «%@».
tr: “%@” tetikleyici ifadesiyle çakışıyor.
zh_hant: 與「%@」的觸發短語衝突。

# panel.layout.edit
source: 编辑面板
ar: تعديل التخطيط
de: Layout bearbeiten
en: Edit Panels
es: Editar disposición
fr: Modifier la disposition
ja: レイアウトを編集
ko: 레이아웃 편집
pt: Editar disposição
ru: Изменить порядок
tr: Panelleri Düzenle
zh_hant: 編輯面板

# panel.layout.done
source: 完成
ar: تم
de: Fertig
en: Done
es: Listo
fr: Terminé
ja: 完了
ko: 완료
pt: Concluído
ru: Готово
tr: Tamamlandı

# panel.layout.earlier
source: 向前移动
ar: نقل إلى السابق
de: Nach vorne bewegen
en: Move Earlier
es: Mover antes
fr: Déplacer avant
ja: 前に移動
ko: 앞으로 이동
pt: Mover antes
ru: Переместить раньше
tr: Yukarı Taşı
zh_hant: 向前移動

# panel.layout.later
source: 向后移动
ar: نقل إلى التالي
de: Nach hinten bewegen
en: Move Later
es: Mover después
fr: Déplacer après
ja: 後ろに移動
ko: 뒤로 이동
pt: Mover depois
ru: Переместить позже
tr: Aşağı Taşı
zh_hant: 向後移動

# panel.layout.beginning
source: 移到开头
ar: نقل إلى البداية
de: An den Anfang bewegen
en: Move to Beginning
es: Mover al principio
fr: Déplacer au début
ja: 先頭に移動
ko: 맨 앞으로 이동
pt: Mover para o início
ru: Переместить в начало
tr: En Başa Taşı
zh_hant: 移到開頭

# panel.layout.end
source: 移到末尾
ar: نقل إلى النهاية
de: Ans Ende bewegen
en: Move to End
es: Mover al final
fr: Déplacer à la fin
ja: 末尾に移動
ko: 맨 뒤로 이동
pt: Mover para o fim
ru: Переместить в конец
tr: En Sona Taşı

# panel.layout.hint
source: 拖移卡片排序，修改会自动保存。
ar: اسحب البطاقات لإعادة ترتيبها. تُحفظ التغييرات تلقائيًا.
de: Karten zum Sortieren ziehen. Änderungen werden automatisch gespeichert.
en: Drag cards to reorder. Changes save automatically.
es: Arrastra las tarjetas para reordenarlas. Los cambios se guardan automáticamente.
fr: Faites glisser les cartes pour les réorganiser. Les modifications sont enregistrées automatiquement.
ja: カードをドラッグして並べ替えます。変更は自動保存されます。
ko: 카드를 드래그하여 순서를 바꾸세요. 변경 사항은 자동으로 저장됩니다.
pt: Arraste os cartões para reordenar. As alterações são guardadas automaticamente.
ru: Перетаскивайте карточки для изменения порядка. Изменения сохраняются автоматически.
tr: Kartları sürükleyerek yeniden sıralayın. Değişiklikler otomatik olarak kaydedilir.
zh_hant: 拖移卡片排序，修改會自動儲存。

# panel.layout.undo
source: 撤销
ar: تراجع
de: Rückgängig
en: Undo
es: Deshacer
fr: Annuler
ja: 元に戻す
ko: 실행 취소
pt: Desfazer
ru: Отменить
tr: Geri Al
zh_hant: 復原

# panel.layout.saved
source: 布局已保存
ar: تم حفظ التخطيط
de: Layout gespeichert
en: Layout saved
es: Disposición guardada
fr: Disposition enregistrée
ja: レイアウトを保存しました
ko: 레이아웃이 저장되었습니다
pt: Disposição guardada
ru: Порядок сохранён
tr: Düzen kaydedildi
zh_hant: 佈局已儲存

# panel.layout.unchanged
source: 位置未改变
ar: لم يتغير الموضع
de: Position unverändert
en: Position unchanged
es: Posición sin cambios
fr: Position inchangée
ja: 位置は変わりません
ko: 위치가 변경되지 않았습니다
pt: Posição inalterada
ru: Позиция не изменилась
tr: Konum değişmedi
zh_hant: 位置未改變

# panel.layout.cancelled
source: 已取消移动
ar: تم إلغاء النقل
de: Verschieben abgebrochen
en: Move cancelled
es: Movimiento cancelado
fr: Déplacement annulé
ja: 移動をキャンセルしました
ko: 이동이 취소되었습니다
pt: Movimento cancelado
ru: Перемещение отменено
tr: Taşıma iptal edildi
zh_hant: 已取消移動

# panel.layout.invalidated
source: 布局已更新，请重新拖移。
ar: تغير التخطيط. اسحب مرة أخرى.
de: Das Layout hat sich geändert. Bitte erneut ziehen.
en: The layout changed. Please drag again.
es: La disposición ha cambiado. Vuelve a arrastrar.
fr: La disposition a changé. Faites glisser à nouveau.
ja: レイアウトが変更されました。もう一度ドラッグしてください。
ko: 레이아웃이 변경되었습니다. 다시 드래그하세요.
pt: A disposição mudou. Arraste novamente.
ru: Порядок изменился. Перетащите ещё раз.
tr: Düzen değişti. Lütfen yeniden sürükleyin.
zh_hant: 佈局已更新，請重新拖移。

# panel.layout.undone
source: 已撤销移动
ar: تم التراجع عن النقل
de: Verschieben rückgängig gemacht
en: Move undone
es: Movimiento deshecho
fr: Déplacement rétabli
ja: 移動を元に戻しました
ko: 이동을 취소했습니다
pt: Movimento desfeito
ru: Перемещение отменено
tr: Taşıma geri alındı
zh_hant: 已復原移動

# panel.layout.position
source: %@，第 %lld 项，共 %lld 项
ar: %@، العنصر %lld من %lld
de: %@, Element %lld von %lld
en: %@, item %lld of %lld
es: %@, elemento %lld de %lld
fr: %@, élément %lld sur %lld
ja: %@、%lld 番目、全 %lld 項目
ko: %@, %lld번째 항목, 총 %lld개
pt: %@, item %lld de %lld
ru: %@, элемент %lld из %lld
tr: %@, %lld. öğe (toplam %lld)
zh_hant: %@，第 %lld 項，共 %lld 項

# cli.install.automaticUpdates
source: CLI 会随 MacTools 自动更新。
ar: يتم تحديث CLI تلقائيًا مع MacTools.
de: Die CLI wird automatisch mit MacTools aktualisiert.
en: The CLI updates automatically with MacTools.
es: La CLI se actualiza automáticamente con MacTools.
fr: La CLI se met à jour automatiquement avec MacTools.
ja: CLI は MacTools と一緒に自動更新されます。
ko: CLI는 MacTools와 함께 자동으로 업데이트됩니다.
pt: A CLI é atualizada automaticamente com o MacTools.
ru: CLI обновляется автоматически вместе с MacTools.
tr: CLI, MacTools ile birlikte otomatik olarak güncellenir.
zh_hant: CLI 會隨 MacTools 自動更新。

# cli.install.rollbackHelp
source: 已保留回退版本；下次 MacTools 更新时将自动更新 CLI。
ar: يتم الاحتفاظ بإصدار CLI السابق حتى التحديث التالي لـ MacTools.
de: Die vorherige CLI-Version bleibt bis zum nächsten MacTools-Update erhalten.
en: The previous CLI version is kept until the next MacTools update.
es: La versión anterior de la CLI se conserva hasta la próxima actualización de MacTools.
fr: La version précédente de la CLI est conservée jusqu’à la prochaine mise à jour de MacTools.
ja: 前の CLI バージョンは、次の MacTools 更新まで保持されます。
ko: 이전 CLI 버전은 다음 MacTools 업데이트까지 유지됩니다.
pt: A versão anterior da CLI é mantida até a próxima atualização do MacTools.
ru: Предыдущая версия CLI сохраняется до следующего обновления MacTools.
tr: Önceki CLI sürümü, bir sonraki MacTools güncellemesine kadar saklanır.
zh_hant: 已保留回退版本；下次 MacTools 更新時將自動更新 CLI。

# cli.install.details
source: 详细信息
ar: التفاصيل
de: Details
en: Details
es: Detalles
fr: Détails
ja: 詳細
ko: 세부사항
pt: Detalhes
ru: Подробности
tr: Ayrıntılar
zh_hant: 詳細資訊

# cli.install.manage
source: 管理
ar: إدارة
de: Verwalten
en: Manage
es: Gestionar
fr: Gérer
ko: 관리
pt: Gerenciar
ru: Управление
tr: Yönet

# cli.install.terminalSetup
source: 终端设置
ar: إعداد الطرفية
de: Terminal-Einrichtung
en: Terminal setup
es: Configuración del terminal
fr: Configuration du terminal
ja: ターミナルの設定
ko: 터미널 설정
pt: Configuração do terminal
ru: Настройка терминала
tr: Terminal kurulumu
zh_hant: 終端機設定

# cli.install.allowConnection
source: 允许 CLI 连接 MacTools
ar: السماح لـ CLI بالاتصال بـ MacTools
de: CLI-Verbindung zu MacTools erlauben
en: Allow CLI to connect to MacTools
es: Permitir que la CLI se conecte a MacTools
fr: Autoriser la CLI à se connecter à MacTools
ja: CLI の MacTools への接続を許可
ko: CLI가 MacTools에 연결하도록 허용
pt: Permitir que a CLI se conecte ao MacTools
ru: Разрешить CLI подключаться к MacTools
tr: CLI'nin MacTools'a bağlanmasına izin ver
zh_hant: 允許 CLI 連線至 MacTools

# cli.install.build
source: 构建版本 %@
ar: البنية %@
de: Build %@
en: Build %@
es: Compilación %@
fr: Build %@
ja: ビルド %@
ko: 빌드 %@
pt: Compilação %@
ru: Сборка %@
tr: Yapı %@
zh_hant: 建置版本 %@

# cli.install.update
source: 更新
ar: تحديث
de: Aktualisieren
en: Update
es: Actualizar
fr: Mettre à jour
ja: アップデート
ko: 업데이트
pt: Atualizar
ru: Обновить
tr: Güncelle

# cli.install.rollback
source: 回退上一版本
ar: استعادة الإصدار السابق
de: Vorherige Version wiederherstellen
en: Restore Previous Version
es: Restaurar versión anterior
fr: Restaurer la version précédente
ja: 前のバージョンに戻す
ko: 이전 버전 복원
pt: Restaurar versão anterior
ru: Вернуть предыдущую версию
tr: Önceki Sürüme Dön
zh_hant: 回復上一版本

# cli.install.remove
source: 移除
ar: إزالة
de: Entfernen
en: Remove
es: Eliminar
fr: Supprimer
ja: 削除
ko: 제거
pt: Remover
ru: Удалить
tr: Kaldır

# cli.install.reveal
source: 在访达中显示
ar: إظهار في Finder
de: Im Finder anzeigen
en: Reveal in Finder
es: Mostrar en Finder
fr: Afficher dans le Finder
ja: Finder に表示
ko: Finder에서 보기
pt: Mostrar no Finder
ru: Показать в Finder
tr: Finder'da Göster
zh_hant: 在 Finder 中顯示

# cli.install.copyPath
source: 复制 CLI 路径
ar: نسخ مسار CLI
de: CLI-Pfad kopieren
en: Copy CLI Path
es: Copiar ruta de la CLI
fr: Copier le chemin de la CLI
ja: CLI のパスをコピー
ko: CLI 경로 복사
pt: Copiar caminho da CLI
ru: Скопировать путь CLI
tr: CLI Yolunu Kopyala
zh_hant: 複製 CLI 路徑

# cli.install.installPrompt
source: 安装 CLI…
ar: تثبيت CLI…
de: CLI installieren…
en: Install CLI…
es: Instalar CLI…
fr: Installer la CLI…
ja: CLI をインストール…
ko: CLI 설치…
pt: Instalar CLI…
ru: Установить CLI…
tr: CLI'yi Yükle…
zh_hant: 安裝 CLI…

# cli.install.retry
source: 重试
ar: إعادة المحاولة
de: Erneut versuchen
en: Retry
es: Reintentar
fr: Réessayer
ja: 再試行
ko: 다시 시도
pt: Tentar novamente
ru: Повторить
tr: Yeniden Dene
zh_hant: 重試

# cli.install.copyDiagnostics
source: 复制诊断信息
ar: نسخ معلومات التشخيص
de: Diagnose kopieren
en: Copy Diagnostics
es: Copiar diagnóstico
fr: Copier le diagnostic
ja: 診断情報をコピー
ko: 진단 정보 복사
pt: Copiar diagnóstico
ru: Скопировать диагностику
tr: Tanılama Bilgilerini Kopyala
zh_hant: 複製診斷資訊

# cli.install.pathHelp
source: 若终端找不到命令，请将 ~/.local/bin 添加到 PATH。MacTools 不会修改 shell 配置。
ar: إذا لم يعثر الطرفية على الأمر، أضف ~/.local/bin إلى PATH. لا يغيّر MacTools إعدادات الصدفة.
de: Falls Terminal den Befehl nicht findet, füge ~/.local/bin zu PATH hinzu. MacTools ändert keine Shell-Konfiguration.
en: If Terminal cannot find the command, add ~/.local/bin to PATH. MacTools does not edit shell configuration.
es: Si Terminal no encuentra el comando, añade ~/.local/bin a PATH. MacTools no modifica la configuración del shell.
fr: Si Terminal ne trouve pas la commande, ajoutez ~/.local/bin au PATH. MacTools ne modifie pas la configuration du shell.
ja: ターミナルでコマンドが見つからない場合は、PATH に ~/.local/bin を追加してください。MacTools はシェル設定を変更しません。
ko: 터미널에서 명령을 찾을 수 없으면 PATH에 ~/.local/bin을 추가하세요. MacTools는 셸 설정을 변경하지 않습니다.
pt: Se o Terminal não encontrar o comando, adicione ~/.local/bin ao PATH. O MacTools não altera a configuração do shell.
ru: Если Терминал не находит команду, добавьте ~/.local/bin в PATH. MacTools не меняет настройки оболочки.
tr: Terminal komutu bulamıyorsa ~/.local/bin dizinini PATH'e ekleyin. MacTools, shell yapılandırmasını düzenlemez.
zh_hant: 若終端機找不到指令，請將 ~/.local/bin 加入 PATH。MacTools 不會修改 shell 設定。

# cli.install.copy
source: 复制
ar: نسخ
de: Kopieren
en: Copy
es: Copiar
fr: Copier
ja: コピー
ko: 복사
pt: Copiar
ru: Копировать
tr: Kopyala
zh_hant: 複製

# cli.install.notInstalled
source: CLI 未安装
ar: CLI غير مثبّت
de: CLI ist nicht installiert
en: CLI is not installed
es: La CLI no está instalada
fr: La CLI n’est pas installée
ja: CLI は未インストールです
ko: CLI가 설치되지 않음
pt: A CLI não está instalada
ru: CLI не установлен
tr: CLI yüklü değil
zh_hant: CLI 尚未安裝

# cli.install.downloading
source: 正在下载 CLI…
ar: جارٍ تنزيل CLI…
de: CLI wird geladen…
en: Downloading CLI…
es: Descargando CLI…
fr: Téléchargement de la CLI…
ja: CLI をダウンロード中…
ko: CLI 다운로드 중…
pt: Baixando CLI…
ru: Загрузка CLI…
tr: CLI indiriliyor…
zh_hant: 正在下載 CLI…

# cli.install.verifying
source: 正在验证 CLI…
ar: جارٍ التحقق من CLI…
de: CLI wird geprüft…
en: Verifying CLI…
es: Verificando CLI…
fr: Vérification de la CLI…
ja: CLI を検証中…
ko: CLI 확인 중…
pt: Verificando CLI…
ru: Проверка CLI…
tr: CLI doğrulanıyor…
zh_hant: 正在驗證 CLI…

# cli.install.installing
source: 正在安装 CLI…
ar: جارٍ تثبيت CLI…
de: CLI wird installiert…
en: Installing CLI…
es: Instalando CLI…
fr: Installation de la CLI…
ja: CLI をインストール中…
ko: CLI 설치 중…
pt: Instalando CLI…
ru: Установка CLI…
tr: CLI yükleniyor…
zh_hant: 正在安裝 CLI…

# cli.install.installed
source: CLI 已安装
ar: CLI مثبّت
de: CLI ist installiert
en: CLI is installed
es: La CLI está instalada
fr: La CLI est installée
ja: CLI はインストール済みです
ko: CLI 설치됨
pt: A CLI está instalada
ru: CLI установлен
tr: CLI yüklü
zh_hant: CLI 已安裝

# cli.install.updateAvailable
source: CLI 有可用更新
ar: يتوفر تحديث لـ CLI
de: CLI-Update verfügbar
en: CLI update available
es: Actualización de CLI disponible
fr: Mise à jour de la CLI disponible
ja: CLI のアップデートがあります
ko: CLI 업데이트 사용 가능
pt: Atualização da CLI disponível
ru: Доступно обновление CLI
tr: CLI güncellemesi var

# cli.install.failed
source: CLI 操作未完成：%@
ar: فشلت عملية CLI: %@
de: CLI-Vorgang fehlgeschlagen: %@
en: CLI operation failed: %@
es: La operación de CLI falló: %@
fr: L’opération CLI a échoué : %@
ja: CLI の操作に失敗しました：%@
ko: CLI 작업 실패: %@
pt: A operação da CLI falhou: %@
ru: Сбой операции CLI: %@
tr: CLI işlemi başarısız oldu: %@

# cli.install.confirmTitle
source: 安装 CLI？
ar: هل تريد تثبيت CLI؟
de: CLI installieren?
en: Install CLI?
es: ¿Instalar CLI?
fr: Installer la CLI ?
ja: CLI をインストールしますか？
ko: CLI를 설치할까요?
pt: Instalar CLI?
ru: Установить CLI?
tr: CLI yüklensin mi?
zh_hant: 安裝 CLI？

# cli.install.paths
source: 安装目录： %@ 命令路径： %@
ar: مجلد التثبيت: %@ مسار الأمر: %@
de: Installationsordner: %@ Befehlspfad: %@
en: Installation directory: %@ Command path: %@
es: Directorio de instalación: %@ Ruta del comando: %@
fr: Dossier d’installation : %@ Chemin de la commande : %@
ja: インストール先： %@ コマンドのパス： %@
ko: 설치 디렉터리: %@ 명령 경로: %@
pt: Diretório de instalação: %@ Caminho do comando: %@
ru: Папка установки: %@ Путь команды: %@
tr: Yükleme dizini: %@ Komut yolu: %@
zh_hant: 安裝目錄： %@ 指令路徑： %@

# cli.install.ownershipHelp
source: 不会覆盖手动、Homebrew 或其他渠道安装。无需管理员密码。
ar: تُحفظ التثبيتات اليدوية وتثبيتات Homebrew والقنوات الأخرى. لا حاجة إلى كلمة سر المسؤول.
de: Manuelle, Homebrew- und andere Kanalinstallationen bleiben erhalten. Kein Administratorpasswort erforderlich.
en: Manual, Homebrew, and other channel installations are preserved. No administrator password is needed.
es: Se conservan las instalaciones manuales, de Homebrew y de otros canales. No se necesita contraseña de administrador.
fr: Les installations manuelles, Homebrew et des autres canaux sont préservées. Aucun mot de passe administrateur n’est requis.
ja: 手動、Homebrew、他のチャネルのインストールは保持されます。管理者パスワードは不要です。
ko: 수동, Homebrew 및 다른 채널의 설치를 유지합니다. 관리자 암호는 필요하지 않습니다.
pt: Instalações manuais, do Homebrew e de outros canais são preservadas. Não é necessária senha de administrador.
ru: Ручные установки, Homebrew и другие каналы сохраняются. Пароль администратора не требуется.
tr: El ile, Homebrew ve diğer kanallardan yapılan yüklemeler korunur. Yönetici parolası gerekmez.
zh_hant: 不會覆蓋手動、Homebrew 或其他管道的安裝。無需管理員密碼。

# cli.install.enableIntegration
source: 启用命令行集成
ar: تمكين تكامل سطر الأوامر
de: Befehlszeilenintegration aktivieren
en: Enable Command-Line Integration
es: Activar integración de línea de comandos
fr: Activer l’intégration en ligne de commande
ja: コマンドライン連携を有効にする
ko: 명령줄 연동 활성화
pt: Ativar integração de linha de comando
ru: Включить интеграцию командной строки
tr: Komut Satırı Entegrasyonunu Etkinleştir
zh_hant: 啟用命令列整合

# cli.install.integrationOn
source: 允许 CLI 连接此应用；macOS 可能要求批准后台运行。
ar: السماح لـ CLI بالاتصال بهذا التطبيق. قد يطلب macOS الموافقة على التشغيل في الخلفية.
de: Die CLI darf sich mit dieser App verbinden. macOS kann eine Genehmigung für Hintergrundobjekte verlangen.
en: Allow the CLI to connect to this app. macOS may require background-item approval.
es: Permite que la CLI se conecte a esta app. macOS puede requerir autorización para ejecutarse en segundo plano.
fr: Autoriser la CLI à se connecter à cette app. macOS peut demander une autorisation en arrière-plan.
ja: CLI にこのアプリへの接続を許可します。macOS でバックグラウンド実行の承認が必要な場合があります。
ko: CLI가 이 앱에 연결하도록 허용합니다. macOS에서 백그라운드 항목 승인이 필요할 수 있습니다.
pt: Permita que a CLI se conecte a este app. O macOS pode exigir aprovação para execução em segundo plano.
ru: Разрешить CLI подключаться к приложению. macOS может запросить разрешение на фоновую работу.
tr: CLI'nin bu uygulamaya bağlanmasına izin verin. macOS, arka plan öğesi onayı isteyebilir.
zh_hant: 允許 CLI 連接此 App；macOS 可能要求核准背景執行。

# cli.install.integrationOff
source: CLI 本机命令仍可使用；访问应用操作需要启用命令行集成。
ar: تبقى أوامر CLI المحلية متاحة. فعّل التكامل للوصول إلى إجراءات التطبيق.
de: Lokale CLI-Befehle bleiben verfügbar. Aktiviere die Integration für App-Aktionen.
en: Local CLI commands remain available. Enable integration to access app actions.
es: Los comandos locales siguen disponibles. Activa la integración para acceder a las acciones de la app.
fr: Les commandes locales restent disponibles. Activez l’intégration pour accéder aux actions de l’app.
ja: CLI のローカルコマンドは利用できます。アプリの操作には連携を有効にしてください。
ko: 로컬 CLI 명령은 계속 사용할 수 있습니다. 앱 작업에 접근하려면 연동을 활성화하세요.
pt: Os comandos locais continuam disponíveis. Ative a integração para acessar ações do app.
ru: Локальные команды CLI доступны. Для действий приложения включите интеграцию.
tr: Yerel CLI komutları kullanılabilir kalır. Uygulama eylemlerine erişmek için entegrasyonu etkinleştirin.
zh_hant: CLI 本機指令仍可使用；存取 App 操作需要啟用命令列整合。

# cli.install.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# cli.install.install
source: 安装
ar: تثبيت
de: Installieren
en: Install
es: Instalar
fr: Installer
ja: インストール
ko: 설치
pt: Instalar
ru: Установить
tr: Yükle
zh_hant: 安裝

# cli.install.error.unsupported
source: 仅支持 Apple 芯片 Mac 上的已签名 MacTools 版本。
ar: يتطلب إصدار MacTools موقّعًا على Apple silicon.
de: Erfordert einen signierten MacTools-Build auf Apple Silicon.
en: Requires a signed MacTools build on Apple silicon.
es: Requiere una versión MacTools firmada en Apple silicon.
fr: Nécessite une version MacTools signée sur Apple silicon.
ja: Apple シリコン上の署名済み MacTools が必要です。
ko: Apple Silicon에서 서명된 MacTools 빌드가 필요합니다.
pt: Requer uma versão MacTools assinada em Apple silicon.
ru: Требуется подписанная сборка MacTools на Apple silicon.
tr: Apple silikon üzerinde imzalı bir MacTools yapısı gerektirir.
zh_hant: 僅支援 Apple 晶片 Mac 上的已簽署 MacTools 版本。

# cli.install.error.metadata
source: 此版本缺少有效的 CLI 安装信息，请更新 MacTools 后重试。
ar: بيانات تثبيت CLI مفقودة أو غير صالحة. حدّث MacTools وأعد المحاولة.
de: CLI-Installationsdaten fehlen oder sind ungültig. Aktualisiere MacTools und versuche es erneut.
en: CLI installation metadata is missing or invalid. Update MacTools and retry.
es: Faltan datos válidos de instalación de la CLI. Actualiza MacTools y reintenta.
fr: Les données d’installation de la CLI sont absentes ou invalides. Mettez MacTools à jour et réessayez.
ja: CLI のインストール情報がないか無効です。MacTools を更新して再試行してください。
ko: CLI 설치 정보가 없거나 유효하지 않습니다. MacTools를 업데이트하고 다시 시도하세요.
pt: Os dados de instalação da CLI estão ausentes ou inválidos. Atualize o MacTools e tente novamente.
ru: Данные установки CLI отсутствуют или недействительны. Обновите MacTools и повторите попытку.
tr: CLI yükleme metaverileri eksik ya da geçersiz. MacTools'u güncelleyip yeniden deneyin.
zh_hant: 此版本缺少有效的 CLI 安裝資訊，請更新 MacTools 後重試。

# cli.install.error.download
source: CLI 下载失败或超过大小限制，请检查网络后重试。
ar: فشل تنزيل CLI أو تجاوز الحد الأقصى للحجم. تحقق من الشبكة وأعد المحاولة.
de: CLI-Download fehlgeschlagen oder zu groß. Prüfe das Netzwerk und versuche es erneut.
en: CLI download failed or exceeded the size limit. Check your network and retry.
es: La descarga de CLI falló o superó el límite de tamaño. Revisa la red y reintenta.
fr: Le téléchargement de la CLI a échoué ou dépasse la taille limite. Vérifiez le réseau et réessayez.
ja: CLI のダウンロードが失敗したか、サイズ制限を超えました。ネットワークを確認して再試行してください。
ko: CLI 다운로드가 실패했거나 크기 제한을 초과했습니다. 네트워크를 확인하고 다시 시도하세요.
pt: O download da CLI falhou ou excedeu o limite de tamanho. Verifique a rede e tente novamente.
ru: Загрузка CLI не удалась или превышен размер. Проверьте сеть и повторите попытку.
tr: CLI indirmesi başarısız oldu ya da boyut sınırını aştı. Ağ bağlantınızı denetleyip yeniden deneyin.
zh_hant: CLI 下載失敗或超過大小限制，請檢查網路後重試。

# cli.install.error.archive
source: CLI 压缩包校验失败，原有安装未更改。
ar: فشل التحقق من أرشيف CLI. لم يتغير التثبيت الحالي.
de: CLI-Archivprüfung fehlgeschlagen. Die bestehende Installation bleibt unverändert.
en: CLI archive verification failed. The existing installation is unchanged.
es: Falló la verificación del archivo CLI. La instalación existente no cambió.
fr: La vérification de l’archive CLI a échoué. L’installation existante est inchangée.
ja: CLI アーカイブの検証に失敗しました。既存のインストールは変更されていません。
ko: CLI 압축 파일 검증에 실패했습니다. 기존 설치는 변경되지 않았습니다.
pt: A verificação do arquivo CLI falhou. A instalação existente não foi alterada.
ru: Проверка архива CLI не удалась. Существующая установка не изменена.
tr: CLI arşivi doğrulanamadı. Mevcut yükleme değişmedi.
zh_hant: CLI 壓縮檔驗證失敗，原有安裝未更改。
